config.org
#+TITLE: Planning My Own Doom
#+AUTHOR: Bryan Paronto
#+EMAIL: bryan@cablecar.digital

* Meta
** Todos
- Leader Mappings for:

- Center content
  - Configure file paths and tempplates

- Known Issues
  Y (in visual mode) - I'd prefer it to yank the whole line. I know this doesn jibe with D or X or C, etc but I need to learn the alternative then.

** Key Guide
|---------+------------------|
| Binding | Description      |
|---------+------------------|
| SPC t t | Toggle File Tree |
|---------+------------------|
| SPC j   | Toggle Comment   |
|---------+------------------|

** Personal Information
#+begin_src emacs-lisp :tangle yes
;; -*- lexical-binding: t; -*-
(setq user-full-name "Bryan Paronto"
      user-mail-address "bryan@cablcar.digital")
#+end_src

* Appearance
** Typography
#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "Victor Mono" :size 18 :weight 'medium)
      doom-variable-pitch-font (font-spec :family  "Victor Mono" :size 18)
      doom-big-font (font-spec :family "Victor Mono" :size 20))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

** Theme Selection
#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'one-dark)
#+end_src

** Welcome Screen Banner
#+begin_src emacs-lisp :tangle yes
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq doom-fallback-buffer "*dashboard*")
  (when (file-exists-p "~/.doom.d.default/banners")
    (setq +doom-dashboard-banner-padding '(0 . 2)
          +doom-dashboard-banner-file "gnu.png"
          +doom-dashboard-banner-dir "~/.doom.d/banners")))
#+end_src

** Frame Opacity
#+begin_src emacs-lisp :tangle yes
(set-frame-parameter (selected-frame)'alpha '(90 . 90))
(add-to-list 'default-frame-alist'(alpha . (90 . 90)))
#+end_src

** Relative Line Numbers
#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type 'relative)
#+end_src

* Org Mode Config
** Where To Save the Org files
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/org/")
#+end_src

** Center Org Buffer Contents
#+begin_src emacs-lisp :tangle yes

(use-package visual-fill-column)
(after! visual-fill-column
  (add-hook! org-mode
    (setq visual-fill-column-center-text t)
    (visual-fill-column-mode 1)))
#+end_src

** Better Typography
#+begin_src emacs-lisp :tangle yes
(defun bp/org-font-setup ()
  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 200)
                  (org-level-2 . 180)
                  (org-level-3 . 200)
                  (org-level-4 . 180)
                  (org-level-5 . 180)
                  (org-level-6 . 180)
                  (org-level-7 . 160)
                  (org-level-8 . 160)))
    (set-face-attribute (car face) nil :font "Victor Mono" :weight 'bold :height (cdr face))))

(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(bp/org-font-setup)
#+end_src

* Key Bindings Config

** Toggle File Tree
#+begin_src emacs-lisp :tangle yes
(after! treemacs
  (map! :leader
      :desc "Toggle file tree"
      "t t" #'treemacs))
#+end_src

** Toggle Comments
#+begin_src emacs-lisp :tangle yes
(map! :leader
      :desc "Toggle comment"
      "j" #'comment-line)
#+end_src
